           SELECT SREKOPF    ASSIGN TO "PAKSRKOP.DAT"
                             ORGANIZATION INDEXED ACCESS DYNAMIC
                             RECORD KEY SK-KEY
                             FILE STATUS IS WF-STATUS.
