           SELECT PROTWAAG   ASSIGN TO WN-BUEB
                             ORGANIZATION INDEXED ACCESS DYNAMIC
                             RECORD KEY PWA-KEY DUPLICATES
                             ALTERNATE KEY PWA-AKEY DUPLICATES
                             FILE STATUS IS WF-STATUS.
