           SELECT INKASSO    ASSIGN TO "PANINKAS.DAT"
                             ORGANIZATION RELATIVE ACCESS DYNAMIC
                             RELATIVE KEY WH-IKEY
                             FILE STATUS IS WF-STATUS.
