           SELECT DAUER      ASSIGN TO DISK "PANEBEST.DAT"
                             ORGANIZATION INDEXED ACCESS DYNAMIC
                             RECORD KEY DA-KEY
                             FILE STATUS IS WF-STATUS.
