           SELECT STATISTIK  ASSIGN TO DISK "PANESTAT.DAT"
                             ORGANIZATION INDEXED ACCESS DYNAMIC
                             RECORD KEY ST-KEY
                             FILE STATUS IS WF-STATUS.
