           SELECT ETIKETT    ASSIGN TO "PANPRETI.DAT"
                             ORGANIZATION INDEXED ACCESS DYNAMIC
                             RECORD KEY ET-KEY
                             FILE STATUS IS WF-STATUS.
