           SELECT REZEPT     ASSIGN TO "PANREZEP.DAT"
                             ORGANIZATION INDEXED ACCESS DYNAMIC
                             RECORD KEY RE-KEY
                             ALTERNATE RECORD KEY RE-AKEY DUPLICATES
                             FILE STATUS IS WF-STATUS.
